app/controllers/reviews_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
---
  def index
    @movie = Movie.find(params[:movie_id])

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "reviews" ("comment", "created_at", "movie_id", "name", "stars", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "Worst"], ["created_at", Mon, 14 Apr 2014 18:12:57 UTC +00:00], ["movie_id", 1], ["name", "Arun"], ["stars", 2], ["updated_at", Mon, 14 Apr 2014 18:12:57 UTC +00:00]]
---
  def create
    @movie = Movie.find(params[:movie_id])
    @review = @movie.reviews.new(review_params)
    if @review.save